polybassa/WyLight/cc3200/example/idle_profile/main.c
//*****************************************************************************
// main.c
//
// Implementing the idle profiling using power mgmt framework
//
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/ 
// 
// 
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//    Redistributions of source code must retain the above copyright 
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the 
//    documentation and/or other materials provided with the   
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

//****************************************************************************
//
//! \addtogroup idle_profile
//! @{
//
//****************************************************************************
#include <string.h>
#include "hw_ints.h"
#include "hw_memmap.h"
#include "simplelink.h"
#include "pinmux.h"
#include "rom_map.h"

//middleware includes
#include "cc_types.h"
#include "rtc_hal.h"
#include "gpio_hal.h"
#include "uart_drv.h"
#include "cc_timer.h"
#include "cc_pm_ops.h"

//driverlib includes
#include "interrupt.h"
#include "prcm.h"
#include "wdt.h"
#include "utils.h"

//OS includes
#include "osi.h"
#ifndef USE_TIRTOS
#include "FreeRTOS.h"
#include "queue.h"
#include "task.h"
#endif

#include "wdt_if.h"

#define SPAWN_TASK_PRIORITY     (9)
#define SSID_NAME              "cc3200demo"
#define GPIO_13                 13
#define GPIO_SRC_WKUP			GPIO_13
#define APP_UDP_PORT            5001    
#define LPDS_DUR_SEC			60
#define LPDS_DUR_NSEC			0
#define FOREVER                 1
#define BUFF_SIZE               1472
#define SL_STOP_TIMEOUT         30
#define OSI_STACK_SIZE          1024
#define CONNECTION_RETRIES		5
#define UART_PRINT(x)           uart_write(g_tUartHndl, x, strlen(x))

#define WD_PERIOD_MS 				10000
#define MAP_SysCtlClockGet 			80000
#define MILLISECONDS_TO_TICKS(ms) 	(MAP_SysCtlClockGet * (ms))

enum ap_events{
	EVENT_CONNECTION = 0x1,
	EVENT_DISCONNECTION = 0x2,
	EVENT_IP_ACQUIRED = 0x4,
	WDOG_EXPIRED = 0x8,
	CONNECTION_FAILED = 0x10
};
//****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//****************************************************************************
void sl_WlanEvtHdlr(SlWlanEvent_t *pSlWlanEvent);
void sl_NetAppEvtHdlr(SlNetAppEvent_t *pNetAppEvent);
static void Display31xxBanner();
void PrintIPAddr(unsigned int uiIpaddr);
void WatchdogIntHandler(void);
int WlanConnect();
void WlanDisconnect();
int gpio_intr_hndlr(int gpio_num);
void TimerCallback(void *vParam);
cc_hndl SetTimerAsWkUp();
cc_hndl SetGPIOAsWkUp();
static void BoardInit();
void UDPServerTask(void *pvParameters);
void TimerGPIOTask(void *pvParameters);
void SwitchToStaMode(int iMode);
//*****************************************************************************
//                      GLOBAL VARIABLES
//****************************************************************************
#ifndef USE_TIRTOS
#if defined(ccs) || defined(gcc)
extern void (* const g_pfnVectors[])(void);
#endif
#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif
#endif

#ifdef DEBUG_GPIO
#define GPIO_09					9
cc_hndl tGPIODbgHndl;
#endif

OsiMsgQ_t g_tConnectionFlag;
OsiMsgQ_t g_tWkupSignalQueue;
cc_hndl g_tUartHndl;
unsigned long g_ulIpAddr = 0;
unsigned char g_ucFeedWatchdog = 0;
unsigned char g_ucWdogCount = 0;
OsiMsgQ_t g_tConnection = 0;
signed char g_cBuffer[BUFF_SIZE];

extern void lp3p0_setup_power_policy(int power_policy);
extern int platform_init();

//*****************************************************************************
//
//! Display31xxBanner
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
Display31xxBanner()
{
    UART_PRINT("\n\n\n\r");
    UART_PRINT("\t\t   *********************************************\n\r");
    UART_PRINT("\t\t          CC3200 Idle Profile Application   \n\r");
    UART_PRINT("\t\t   *********************************************\n\r");
    UART_PRINT("\n\n\n\r");

}

//*****************************************************************************
//
//! Application defined hook (or callback) function - the tick hook.
//! The tick interrupt can optionally call this
//!
//! \param  none
//! 
//! \return none
//!
//*****************************************************************************
void vApplicationTickHook( void )
{
}

//*****************************************************************************
//
//! Application defined hook (or callback) function - assert
//!
//! \param  none
//! 
//! \return none
//!
//*****************************************************************************
void vAssertCalled( const char *pcFile, unsigned long ulLine )
{
	while(1)
	{
	}
}

//*****************************************************************************
//
//! Application defined idle task hook
//! 
//! \param  none
//! 
//! \return none
//!
//*****************************************************************************
void vApplicationIdleHook( void )
{
    cc_idle_task_pm();
}

//*****************************************************************************
//
//! Application defined malloc fail hook
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void vApplicationMallocFailedHook()
{
	while(1)
	{
	}
}

//*****************************************************************************
//
//! Application defined stack overflow hook
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
void vApplicationStackOverflowHook()
{
	while(1)
	{
	}
}

//*****************************************************************************
//
//! Print the IP address in the dotted decimal form
//!
//! \param  uiIpaddr is the IP address of the device in integer form
//!
//! \return none
//!
//*****************************************************************************
void PrintIPAddr(unsigned int uiIpaddr)
{
	char pcIpString[16];
	unsigned char ucLen1, ucLen2, ucLen3, ucLen4;
	ucLen1 = sprintf(pcIpString, "%u", (uiIpaddr & 0xFF000000)>>24);
	ucLen2 = sprintf((pcIpString + ucLen1), ".%u", (uiIpaddr & 0x00FF0000)>>16);
	ucLen3 = sprintf((pcIpString + ucLen1 + ucLen2), ".%u",
					 (uiIpaddr & 0x0000FF00)>>8);
	ucLen4 = sprintf((pcIpString + ucLen1 + ucLen2 + ucLen3), ".%u\0",
					 (uiIpaddr & 0x000000FF));
	UNUSED(ucLen4);
	UART_PRINT(pcIpString);
}

//****************************************************************************
//
//! \brief This function handles WLAN events
//!
//! \param[in]  pSlWlanEvent is the event passed to the handler
//!
//! \return	None
//
//****************************************************************************
void sl_WlanEvtHdlr(SlWlanEvent_t *pSlWlanEvent)
{
	unsigned char ucQueueMsg = 0;
	switch(pSlWlanEvent->Event)
	{
	case SL_WLAN_CONNECT_EVENT:
		ucQueueMsg = (unsigned char)EVENT_CONNECTION;
		if(g_tConnection != 0)
		{
			osi_MsgQWrite(&g_tConnection, &ucQueueMsg, OSI_WAIT_FOREVER);
		}
		else
		{
            UART_PRINT("Error: sl_WlanEvtHdlr: Queue does not exist\n\r");
			while(FOREVER);
		}
		UART_PRINT("C\n\r");
		break;
	case SL_WLAN_DISCONNECT_EVENT:
		ucQueueMsg = (unsigned char)EVENT_DISCONNECTION;
		if(g_tConnection != 0)
		{
			osi_MsgQWrite(&g_tConnection, &ucQueueMsg, OSI_WAIT_FOREVER);
		}
		else
		{
            UART_PRINT("Error: sl_WlanEvtHdlr: Queue does not exist\n\r");
			while(FOREVER);
		}
		UART_PRINT("D\n\r");
		break;
	default:
		break;
	}
}

//****************************************************************************
//
//! \brief This function handles events for IP address acquisition via DHCP
//!		   indication
//!
//! \param[in]    pNetAppEvent is the event passed to the handler
//!
//! \return     None
//
//****************************************************************************
void sl_NetAppEvtHdlr(SlNetAppEvent_t *pNetAppEvent)
{
	unsigned char ucQueueMsg = 0;
	switch(pNetAppEvent->Event)
	{
	case SL_NETAPP_IPV4_ACQUIRED:
	case SL_NETAPP_IPV6_ACQUIRED:
		g_ulIpAddr = pNetAppEvent->EventData.ipAcquiredV4.ip;
		ucQueueMsg = (unsigned char)EVENT_IP_ACQUIRED;
		if(g_tConnection != 0)
		{
			osi_MsgQWrite(&g_tConnection, &ucQueueMsg, OSI_WAIT_FOREVER);
		}
		else
		{
            UART_PRINT("Error: sl_NetAppEvtHdlr: Queue does not exist\n\r");
			while(FOREVER);
		}
		UART_PRINT("IP: ");
		PrintIPAddr(g_ulIpAddr);
		UART_PRINT("\n\r");
		break;
	default:
		break;
	}
}

//*****************************************************************************
//
//! This function gets triggered when HTTP Server receives Application
//! defined GET and POST HTTP Tokens.
//!
//! \param pSlHttpServerEvent Pointer indicating http server event
//! \param pSlHttpServerResponse Pointer indicating http server response
//!
//! \return None
//!
//*****************************************************************************
void sl_HttpServerCallback(SlHttpServerEvent_t *pSlHttpServerEvent,
                           SlHttpServerResponse_t *pSlHttpServerResponse)
{
}


//*****************************************************************************
//
//! This function handles socket events indication
//!
//! \param[in]      pSock - Pointer to Socket Event Info
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkSockEventHandler(SlSockEvent_t *pSock)
{
    //
    // This application doesn't work w/ socket - Events are not expected
    //

