polybassa/WyLight/cc3200/example/idle_profile/main.c
}

//*****************************************************************************
//
//! The interrupt handler for the watchdog timer
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
void WatchdogIntHandler(void)
{
    //
    // If we have been told to stop feeding the watchdog, return immediately
    // without clearing the interrupt.  This will cause the system to reset
    // next time the watchdog interrupt fires.
    //
    if(!g_ucFeedWatchdog)
    {
        return;
    }

    unsigned char ucQueueMsg = 0;
    if(g_ucWdogCount < CONNECTION_RETRIES)
    {
    	g_ucWdogCount++;
		ucQueueMsg = (unsigned char)WDOG_EXPIRED;
		MAP_WatchdogIntClear(WDT_BASE);
    }
    else
    {
        g_ucFeedWatchdog = 0;
    	ucQueueMsg = (unsigned char)CONNECTION_FAILED;
        MAP_WatchdogIntClear(WDT_BASE);
    }
    if(g_tConnection != 0)
    {
        osi_MsgQWrite(&g_tConnection, &ucQueueMsg, OSI_NO_WAIT);
    }
    else
    {
        UART_PRINT("Error: WatchdogIntHandler: Queue does not exist\n\r");
    }
}

//*****************************************************************************
//
//! \brief Connecting to a WLAN Accesspoint
//! This function connects to the required AP (SSID_NAME).
//! This code example assumes the AP doesn't use WIFI security.
//! The function will return only once we are connected
//! and have acquired IP address
//!
//! \param[in] None
//!
//! \return 0 means success, -1 means failure
//!
//! \note
//!
//! \warning    If the WLAN connection fails or we don't aquire an IP address,
//!             We will be stuck in this function forever.
//
//*****************************************************************************
int WlanConnect()
{
	int iRetCode = 0;
	int iRetVal = 0;
	int iConnect = 0;
	unsigned char ucQueueMsg = 0;
    SlSecParams_t secParams;

    secParams.Key = "";
    secParams.KeyLen = sizeof(secParams.Key);
    secParams.Type = SL_SEC_TYPE_OPEN;

	//
	// Enable the peripherals used by this example.
	//
	MAP_PRCMPeripheralClkEnable(PRCM_WDT, PRCM_RUN_MODE_CLK);

	//
	// Set up the watchdog interrupt handler.
	//
	WDT_IF_Init(WatchdogIntHandler, MILLISECONDS_TO_TICKS(WD_PERIOD_MS));

	//
	// Start the timer. Once the timer is started, it cannot be disable.
	//
	MAP_WatchdogEnable(WDT_BASE);
	g_ucFeedWatchdog = 1;
	while(!(ucQueueMsg & (EVENT_IP_ACQUIRED|CONNECTION_FAILED)))
	{
		UART_PRINT("Trying to connect to AP: ");
		UART_PRINT(SSID_NAME);
		UART_PRINT("\n\r");
		sl_WlanConnect(SSID_NAME, strlen(SSID_NAME), 0, &secParams, 0);
		iConnect = 0;
		do{
			osi_MsgQRead(&g_tConnection, &ucQueueMsg, OSI_WAIT_FOREVER);

			switch(ucQueueMsg){
			case EVENT_CONNECTION:
				iConnect = 1;
				break;

			case EVENT_IP_ACQUIRED:
				iRetVal = 0;
				break;

			case WDOG_EXPIRED:
				//
				// disconnect from the Access Point
				//
				if(iConnect)
				{
					WlanDisconnect();
				}

				//
				// stop the simplelink with reqd. timeout value (30 ms)
				//
				sl_Stop(SL_STOP_TIMEOUT);
                UART_PRINT("sl stop\n\r");
				MAP_UtilsDelay(8000);

				//
				// starting the simplelink
				//
				sl_Start(NULL, NULL, NULL);
				UART_PRINT("sl start\n\r");
				break;

			case EVENT_DISCONNECTION:
				iConnect = 0;
				break;

			case CONNECTION_FAILED:
				iRetVal = -1;
				break;

			default:
				UART_PRINT("unexpected event\n\r");
				break;
			}
		}while(ucQueueMsg == (unsigned char)EVENT_CONNECTION);
	}
	iRetCode = MAP_WatchdogRunning(WDT_BASE);
	if(iRetCode)
	{
	   WDT_IF_DeInit();
	   MAP_PRCMPeripheralClkDisable(PRCM_WDT, PRCM_RUN_MODE_CLK);
	}
    return(iRetVal);
}

//*****************************************************************************
//
//! \brief disconnection from the WLAN Accesspoint
//!
//! \param[in] None
//!
//! \return None
//!
//! \note
//!
//! \warning    If the WLAN disconnection fails, We will be stuck in this
//!             function forever.
//
//*****************************************************************************
void WlanDisconnect()
{
	unsigned char ucQueueMsg = 0;
	while(ucQueueMsg != (unsigned char)EVENT_DISCONNECTION)
	{
		sl_WlanDisconnect();
		osi_MsgQRead(&g_tConnection, &ucQueueMsg, OSI_WAIT_FOREVER);
	}
    return;
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
  //
  // Set vector table base
  //
#if defined(ccs) || defined(gcc)
    IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
    IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
  //
  // Enable Processor
  //
  MAP_IntMasterEnable();
  MAP_IntEnable(FAULT_SYSTICK);

  PRCMCC3200MCUInit();
}

//*****************************************************************************
//
//! \brief callback function for gpio interrupt handler
//!
//! \param gpio_num is the gpio number which has triggered the interrupt
//!
//! \return 0
//
//*****************************************************************************
int gpio_intr_hndlr(int gpio_num)
{
    unsigned char queue_msg = 2;

    if(GPIO_SRC_WKUP == gpio_num)
    {
        osi_MsgQWrite(&g_tWkupSignalQueue, &queue_msg, OSI_NO_WAIT);
    }
    return 0;
}

//*****************************************************************************
//
//! \brief callback function for timer interrupt handler
//!
//! \param vParam is a general void pointer (not used here)
//!
//! \return None
//
//*****************************************************************************
void TimerCallback(void *vParam)
{
    unsigned char ucQueueMsg = 1;
    osi_MsgQWrite(&g_tWkupSignalQueue, &ucQueueMsg, OSI_NO_WAIT);
    return;
}

//*****************************************************************************
//
//! \brief set GPIO as a wake up source from low power modes.
//!
//! \param none
//!
//! \return handle for the gpio used
//
//*****************************************************************************
cc_hndl SetGPIOAsWkUp()
{
    cc_hndl tGPIOHndl;
    //
    // setting up GPIO as a wk up source and configuring other related
    // parameters
    //
    tGPIOHndl = cc_gpio_open(GPIO_SRC_WKUP, GPIO_DIR_INPUT);
    cc_gpio_enable_notification(tGPIOHndl, GPIO_SRC_WKUP, INT_FALLING_EDGE,
                                (GPIO_TYPE_NORMAL | GPIO_TYPE_WAKE_SOURCE));
    return(tGPIOHndl);
}

//*****************************************************************************
//
//! \brief set Timer as a wake up source from low power modes.
//!
//! \param none
//!
//! \return handle for the Timer setup as a wakeup source
//
//*****************************************************************************
cc_hndl SetTimerAsWkUp()
{
    cc_hndl tTimerHndl;
    struct cc_timer_cfg sRealTimeTimer;
    struct u64_time sInitTime, sIntervalTimer;
    //
    // setting up Timer as a wk up source and other timer configurations
    //
    sInitTime.secs = 0;
    sInitTime.nsec = 0;
    cc_rtc_set(&sInitTime);

