polybassa/WyLight/cc3200/example/idle_profile/main.c
    sRealTimeTimer.source = HW_REALTIME_CLK;
    sRealTimeTimer.timeout_cb = TimerCallback;
    sRealTimeTimer.cb_param = NULL;

    tTimerHndl = cc_timer_create(&sRealTimeTimer);

    sIntervalTimer.secs = LPDS_DUR_SEC;
    sIntervalTimer.nsec = LPDS_DUR_NSEC;
    cc_timer_start(tTimerHndl, &sIntervalTimer, OPT_TIMER_PERIODIC);
    return(tTimerHndl);
}

//*****************************************************************************
//
//! Check the device mode and switch to STATION(STA) mode
//! restart the NWP to activate STATION mode
//!
//! \param  iMode (device mode)
//!
//! \return None
//
//*****************************************************************************
void SwitchToStaMode(int iMode)
{
	if(iMode != ROLE_STA)
	{
	    sl_WlanSetMode(ROLE_STA);
	    MAP_UtilsDelay(80000);
	    sl_Stop(10);
	    MAP_UtilsDelay(80000);
	    sl_Start(0,0,0);
	}

}

//*****************************************************************************
//
//! \brief Task Created by main fucntion.This task starts simpleink, set NWP
//!        power policy, connects to an AP. Give Signal to the other task about
//!        the connection.wait for the message form the interrupt handlers and
//!        the other task. Accordingly print the wake up cause from the low
//!        power modes.
//!
//! \param pvParameters is a general void pointer (not used here).
//!
//! \return none
//
//*****************************************************************************
void TimerGPIOTask(void *pvParameters)
{
    cc_hndl tTimerHndl = NULL; 
    cc_hndl tGPIOHndl = NULL;
    unsigned char ucQueueMsg = 0;
    unsigned char ucSyncMsg = 0;
    int iMode = 0;
    //
    // Displays the Application Banner
    //
    Display31xxBanner();
    
    //
    // starting the simplelink
    //
    iMode = sl_Start(NULL, NULL, NULL);
    
    //
    // Swtich to STA mode if device is not
    //
    SwitchToStaMode(iMode);

    //
    // Set the power management policy of NWP
    //
    sl_WlanPolicySet(SL_POLICY_PM, SL_NORMAL_POLICY, NULL, 0);
    
    osi_MsgQCreate(&g_tConnection, NULL, sizeof( unsigned char ), 3);
    //
    // connecting to the Access Point
    //
    if(-1 == WlanConnect())
    {
    	sl_Stop(SL_STOP_TIMEOUT);
    	UART_PRINT("Connection to AP failed\n\r");
    }
    else
    {
    	UART_PRINT("Connected to AP\n\r");
    	//
		//signal the other task about the sl start and connection to the AP
		//
		osi_MsgQWrite(&g_tConnectionFlag, &ucSyncMsg, OSI_WAIT_FOREVER);
    }
    
    //
    // Queue management related configurations
    //
    osi_MsgQCreate(&g_tWkupSignalQueue, NULL, sizeof( unsigned char ), 10);
    
    //
    // setting Timer as one of the wakeup source
    //
    tTimerHndl = SetTimerAsWkUp();
    
    //
    // setting some GPIO as one of the wakeup source
    //
    tGPIOHndl = SetGPIOAsWkUp();
    
    /* handles, if required, can be used to stop the timer, but not used here*/
    UNUSED(tTimerHndl);
    UNUSED(tGPIOHndl);
    //
    // setting Apps power policy
    //
    lp3p0_setup_power_policy(POWER_POLICY_STANDBY);
    
    while(FOREVER)
    {
        //
        // waits for the message from the various interrupt handlers(GPIO,
        // Timer) and the UDPServerTask.
        //
        osi_MsgQRead(&g_tWkupSignalQueue, &ucQueueMsg, OSI_WAIT_FOREVER);
        switch(ucQueueMsg){
        case 1:
            UART_PRINT("timer\n\r");
            break;
        case 2:
            UART_PRINT("GPIO\n\r");
            break;
        case 3:
            UART_PRINT("host irq\n\r");
            break;
        default:
            UART_PRINT("invalid msg\n\r");
            break;
        }
    }
}

//*****************************************************************************
//
//! \brief Task Created by main fucntion. This task creates a udp server and
//!        wait for packets. Upon receiving the packet, signals the other task.
//!
//! \param pvParameters is a general void pointer (not used here).
//!
//! \return none
//
//*****************************************************************************
void UDPServerTask(void *pvParameters)
{
    unsigned char ucSyncMsg;
    unsigned char ucQueueMsg = 3;
    int iSockDesc = 0;
    int iRetVal = 0;
    sockaddr_in sLocalAddr;
    sockaddr_in sClientAddr;
    unsigned int iAddrSize = 0;
       
    //
    // waiting for the other task to start simplelink and connection to the AP
    //
    osi_MsgQRead(&g_tConnectionFlag, &ucSyncMsg, OSI_WAIT_FOREVER);
    osi_MsgQDelete(&g_tConnectionFlag);
    
    //
    // configure the Server
    //
    sLocalAddr.sin_family = SL_AF_INET;
    sLocalAddr.sin_port = sl_Htons((unsigned short)APP_UDP_PORT);
    sLocalAddr.sin_addr.s_addr = 0;
    
    iAddrSize = sizeof(sockaddr_in);
    
    //
    // creating a UDP socket
    //
    iSockDesc = sl_Socket(SL_AF_INET,SL_SOCK_DGRAM, 0);

    if(iSockDesc < 0)
    {
        UART_PRINT("sock error\n\r");
        while(FOREVER);
    }
    
    //
    // binding the socket
    //
    iRetVal = sl_Bind(iSockDesc, (SlSockAddr_t *)&sLocalAddr, iAddrSize);
    if(iRetVal < 0)
    {
        UART_PRINT("bind error\n\r");
        while(FOREVER);
    }
    
    while(FOREVER)
    {
        //
        // waiting on a UDP packet
        //
        iRetVal = sl_RecvFrom(iSockDesc, g_cBuffer, BUFF_SIZE, 0,
                              ( SlSockAddr_t *)&sClientAddr,
                              (SlSocklen_t*)&iAddrSize );
        if(iRetVal > 0)
        {
            //
            // signal the other task about receiving the UDP packet
            //
            osi_MsgQWrite(&g_tWkupSignalQueue, &ucQueueMsg, OSI_WAIT_FOREVER);
        }
        else
        {
            UART_PRINT("recv error\n\r");
            while(FOREVER);
        }
    }  
}
    
//****************************************************************************
//							MAIN FUNCTION
//****************************************************************************
void main(void)
{
    //
    // Board Initialization
    //
    BoardInit();
    
    //
    // Configure the pinmux settings for the peripherals exercised
    //
    PinMuxConfig();
    
    //
    // Initialize the platform
    //
    platform_init();

    //
    // Configuring UART
    //
    g_tUartHndl = uart_open(PRCM_UARTA0);

#ifdef DEBUG_GPIO
	//
	// setting up GPIO for indicating the entry into LPDS
	//
	tGPIODbgHndl = cc_gpio_open(GPIO_09, GPIO_DIR_OUTPUT);
	cc_gpio_write(tGPIODbgHndl, GPIO_09, 1);
#endif
    //
    // Start the SimpleLink Host
    //
    VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);

    //
    // sync object for inter thread communication
    //
    osi_MsgQCreate(&g_tConnectionFlag, NULL, sizeof( unsigned char ), 1);

    //
    // Task creation for providing host_irq as a wake up source(LPDS)
    //
    osi_TaskCreate(UDPServerTask, 
                (const signed char *)"UDP Server waiting to recv packets",
                OSI_STACK_SIZE, NULL, 1, NULL );
    //
    // setting up timer and gpio as source for wake up from lPDS
    //
    osi_TaskCreate(TimerGPIOTask, (const signed char*)
                   "Configuring Timer and GPIO as wake src",
                   OSI_STACK_SIZE, NULL, 1, NULL );

    //
    // Start the task scheduler
    //
    osi_start();

}
